testCase2_simpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



convertToMeters 1;


vertices
(
    (-8.28 -5.52 -3.0911999999999997)
    (7.176 -5.52 -3.0911999999999997)
    (7.176 5.52 -3.0911999999999997)
    (-8.28 5.52 -3.0911999999999997)
    (-8.28 -5.52 0.0)
    (7.176 -5.52 0.0)
    (7.176 5.52 0.0)
    (-8.28 5.52 0.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (35 25 7) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type symmetryPlane;
        faces
        (
             (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side1
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    side2
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
