testCase2_simpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "pcorr.*"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            smoother        GaussSeidel;
            tolerance       1e-5;
            relTol          0;
        };
        tolerance       1e-5;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-7;
        relTol          0.01;
    }

    p_Final
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|omega).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         1;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }

        Phi
		        {
				                solver          GAMG;
						                smoother        DIC;
								                tolerance       1e-06;
										                relTol          0.01;
}




"cellDisplacement.*"
        {
                solver       GAMG;
                smoother     GaussSeidel;
                tolerance    1e-09;
                relTol       0;
        }
        yPsi
        {
                solver       GAMG;
                smoother     GaussSeidel;
                tolerance    1e-09;
                relTol       0.0;
        }
        yPsiFinal
        {
                $yPsi;
        }
}

SIMPLE
{
	    nNonOrthogonalCorrectors 2;
	        consistent yes;
residualControl
{
	    p           1e-5;
	     U   1e-5;
}

}
potentialFlow
{
	    nNonOrthogonalCorrectors 10;
	        consistent yes;
}


relaxationFactors
{
	    equations
		        {
				        U               0.9;
					        k               0.7;
						        omega           0.7;
							    }
}


cache
{
    grad(U);
}


// ************************************************************************* //
