testCase2_simpleFoam/system/shipSpecs

{



"Lpp":2.76,
"b":0.36,
"d":0.13,
"v":1.09,
"drift":0,
"lcog":1.372,
"z0":1.372,


"dom":[-3,2.5,-2,2,-1,0],
"maxRefLevel":6,
"minCellSize":400, 


"yPlusTarget":90,
"growthRatio":1.3

}
